{"format": "graph-model", "generatedBy": "2.11.1", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"audio": {"name": "audio:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"classifier": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_3/my_model/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/my_model/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/my_model/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/my_model/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/classifier/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "audio", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer1/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer12/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer1/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer2/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer2/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer2/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer2/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer13/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer3/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer3/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer3/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer3/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer13/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer4/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer4/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer4/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer4/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer5/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer5/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer5/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer13/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer5/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer6/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer6/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer6/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer13/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer6/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer7/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer7/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer7/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer7/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer14/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer8/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer8/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer8/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer8/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer14/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer9/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer9/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer9/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer9/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer10/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer10/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer10/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer14/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer10/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer11/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer11/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer11/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer14/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer11/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer12/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer12/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/layer12/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape/Shape", "op": "Shape", "input": ["audio"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_4/Mul_4/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_3/concat_3/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_3/FloorDiv_3/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_4/values_1/concat_4/values_1/1", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_4/concat_4/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range_1/Range_1/start", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range_1/Range_1/delta", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_6/shape/Reshape_6/shape/1", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_5/AddV2_5/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_GatherV2_1/GatherV2_1/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_3/Maximum_3/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_4/AddV2_4/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_4/Reshape_4/shape", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_4/Sub_4/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_2/FloorDiv_2/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_5/values_1/Sub_4/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_1/Mul_1/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat/concat/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_1/values_1/concat_1/values_1/1", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_1/concat_1/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range/Range/start", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range/Range/delta", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_2/Mul_2/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_2/shape/Reshape_2/shape/1", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_2/AddV2_2/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_GatherV2/GatherV2/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_2/Maximum_2/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_1/AddV2_1/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape/Reshape/shape", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_3/Sub_3/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv/FloorDiv/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_2/values_1/Sub_3/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0/0", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum/Maximum/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv_recip", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice/begin", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice/end", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice/strides", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_1/Sub/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub/x", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split/split/size_splits", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split/split/split_dim", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_2/concat_2/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_3/Mul_3/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad_1/Pad_1/paddings", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RFFT/RFFT/fft_length", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_MatMul/MatMul/b", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_3/AddV2_3/y", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1/size_splits", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1/split_dim", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_5/concat_5/axis", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/reshape/strided_slice/stack", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/reshape/strided_slice/stack_1", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/reshape/strided_slice/stack_2", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/reshape/Reshape/shape/1", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/reshape/Reshape/shape/2", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/reshape/Reshape/shape/3", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "input": ["^audio"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape/Shape", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice/begin", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice/end", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice/strides"], "attr": {"shrink_axis_mask": {"i": "1"}, "_cloned": {"b": true}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub/x", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_1/Maximum_1", "op": "Maximum", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_1/Sub/x"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum/Maximum/x", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_1/Maximum_1", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub/x"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "_cloned": {"b": true}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast/Cast", "ConstantFolding/StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv_recip"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Ceil/Ceil", "op": "Ceil", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Ceil/Ceil"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul/x", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast_1/Cast_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_2/Sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub_1"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum/Maximum", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_2/Sub_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0", "op": "Pack", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0/0", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2/AddV2"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/Pad/paddings_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/Pad/paddings", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0", "ConstantFolding/StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/Pad/paddings_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad", "op": "Pad", "input": ["audio", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_ZerosLike/ZerosLike", "op": "Const", "input": ["^StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_1/Shape_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "_cloned": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split/split", "op": "SplitV", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_1/Shape_1", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split/split/size_splits", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split/split/split_dim"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "_cloned": {"b": true}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Fill/Fill", "op": "Const", "input": ["^StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_ZerosLike/ZerosLike"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "_cloned": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_split/split:1", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape/Reshape/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1", "op": "FloorDiv", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape/Reshape", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_3/Sub_3", "op": "Sub", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape/Reshape", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_3/Sub_3/y"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_1/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_1/Mul_1/y"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_1/values_1/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1", "StatefulPartitionedCall/model_3/yamnet/StatefulPartitionedCall/StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_1/values_1/concat_1/values_1/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": 